### 1341. Movie Rating

### 테이블 구조

Table: Movies

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| movie_id      | int     |
| title         | varchar |
+---------------+---------+
movie_id is the primary key (column with unique values) for this table.
title is the name of the movie.
 

Table: Users

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| user_id       | int     |
| name          | varchar |
+---------------+---------+
user_id is the primary key (column with unique values) for this table.

Table: MovieRating

+---------------+---------+
| Column Name   | Type    |
+---------------+---------+
| movie_id      | int     |
| user_id       | int     |
| rating        | int     |
| created_at    | date    |
+---------------+---------+
(movie_id, user_id) is the primary key (column with unique values) for this table.
This table contains the rating of a movie by a user in their review.
created_at is the user's review date.

### 문제

Write a solution to:

Find the name of the user who has rated the greatest number of movies.
In case of a tie, return the lexicographically smaller user name.

Find the movie name with the highest average rating in February 2020.
In case of a tie, return the lexicographically smaller movie name.

### Output

Output: 
+--------------+
| results      |
+--------------+
| Daniel       |
| Frozen 2     |
+--------------+

### 모듈 import

In [1]:
import pandas as pd
import numpy as np
import warnings

warnings.filterwarnings('ignore')

### DataFrame

In [34]:
data = [[1, 'Avengers'], [2, 'Frozen 2'], [3, 'Joker']]
movies = pd.DataFrame(data, columns=['movie_id', 'title']).astype({'movie_id':'Int64', 'title':'object'})
data = [[1, 'Daniel'], [2, 'Monica'], [3, 'Maria'], [4, 'James']]
users = pd.DataFrame(data, columns=['user_id', 'name']).astype({'user_id':'Int64', 'name':'object'})
data = [[1, 1, 3, '2020-01-12'], [1, 2, 4, '2020-02-11'], [1, 3, 2, '2020-02-12'], [1, 4, 1, '2020-01-01'], [2, 1, 5, '2020-02-17'], [2, 2, 2, '2020-02-01'], [2, 3, 2, '2020-03-01'], [3, 1, 3, '2020-02-22'], [3, 2, 4, '2020-02-25']]
movie_rating = pd.DataFrame(data, columns=['movie_id', 'user_id', 'rating', 'created_at']).astype({'movie_id':'Int64', 'user_id':'Int64', 'rating':'Int64', 'created_at':'datetime64[ns]'})

In [35]:
movies

   movie_id     title
0         1  Avengers
1         2  Frozen 2
2         3     Joker

In [36]:
users

   user_id    name
0        1  Daniel
1        2  Monica
2        3   Maria
3        4   James

In [37]:
movie_rating

   movie_id  user_id  rating created_at
0         1        1       3 2020-01-12
1         1        2       4 2020-02-11
2         1        3       2 2020-02-12
3         1        4       1 2020-01-01
4         2        1       5 2020-02-17
5         2        2       2 2020-02-01
6         2        3       2 2020-03-01
7         3        1       3 2020-02-22
8         3        2       4 2020-02-25

### 문제풀이

In [38]:
result = pd.DataFrame(columns=['results'])
result

Empty DataFrame
Columns: [results]
Index: []

In [ ]:
movie_rating_with_user_name = pd.merge(movie_rating, users, on='user_id')[['name', 'movie_id']]

In [49]:
df1 = movie_rating_with_user_name.groupby(['name']).size().reset_index(name='counts')
df1.sort_values(by=['counts','name'], ascending=[False, True], inplace=True)
result.loc[0, 'results'] = df1.iloc[0]['name']

  results
0  Daniel

In [51]:
movie_rating_with_title = pd.merge(movie_rating, movies, on='movie_id')[['created_at', 'title', 'rating']]

  created_at     title  rating
0 2020-01-12  Avengers       3
1 2020-02-11  Avengers       4
2 2020-02-12  Avengers       2
3 2020-01-01  Avengers       1
4 2020-02-17  Frozen 2       5
5 2020-02-01  Frozen 2       2
6 2020-03-01  Frozen 2       2
7 2020-02-22     Joker       3
8 2020-02-25     Joker       4

In [57]:
cond = movie_rating_with_title['created_at'] == '2020-02'
df2 = movie_rating_with_title[cond].drop('created_at', axis=1)

      title  rating
5  Frozen 2       2

In [59]:
df2 = df2.groupby('title').agg({'rating':'mean'}).reset_index()
df2.sort_values(by=['rating','title'], ascending=[False, True], inplace=True)
result.loc[1, 'results'] = df2.iloc[0]['title']
result

    results
0    Daniel
1  Frozen 2